C12/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
/*
        type             uniformFixedValue;
	uniformValue     table
	(
    		(0   (1 0 0))
    		(20  (2 0 0))
   		(40  (1 0 0))
	); 
*/
	type		zeroGradient;
        //type            fixedValue;
        //value           uniform (2 0 0);
    }

    outlet
    {
        type		fixedValue;
        value		uniform (1.5968 0 0);
        //type            zeroGradient;
	
	/*
	type		inletOutlet;
	phi		phi;
	inletValue	uniform (1 0 0);
	value		uniform (1 0 0);
	*/
    }

//Ensure that the conditions below are in line with the blockMeshDict parameters.
    minY
    {
		type		cyclic;
		//type		slip;
		//type		symmetryPlane;
    }

    maxY
    {
		type		cyclic;
		//type		slip;
		//type		symmetryPlane;
    }

    minZ
    {
		type		cyclic;
		//type		slip;
		//type		symmetryPlane;
    }

    maxZ
    {
		type		cyclic;
		//type		slip;
		//type		symmetryPlane;
    }

    solidSurfaces
    {
        type            noSlip;
    }
}

// ************************************************************************* //
