C12/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//The value for k is a function of velocity, and turbulence intensity

dimensions      [0 2 -2 0 0 0 0];

// Originally 0.09375 for k
// See https://www.cfd-online.com/Wiki/Turbulence_free-stream_boundary_conditions
// for information on how to estimate these values

kConstant	9.56E-03;

//internalField   uniform 0.00015;
//internalField   uniform 0.09375;
internalField   uniform $kConstant;

boundaryField
{
    inlet
    {
        //type            inletOutlet; // inletOutlet combination uses inletValue I think
        //inletValue	uniform 0.09375;
        
        type		fixedValue;
        value           uniform $kConstant;
    }
    outlet
    {
        type            zeroGradient;
    }
//Ensure that the parameters below are in line with the parameters in the blockMeshDict
    minY
    {
    	type		cyclic;
	//type		kqRWallFunction;
	//value		uniform 0.09375;
	//type		symmetryPlane;
    }
    maxY
    {
    	type		cyclic;
	//type		kqRWallFunction;
	//value		uniform 0.09375;
	//type		symmetryPlane;
    }
    minZ
    {
    	type		cyclic;
	//type		kqRWallFunction;
	//value		uniform 0.09375;
	//type		symmetryPlane;
    }
    maxZ
    {
    	type		cyclic;
	//type		kqRWallFunction;
	//value		uniform 0.09375;
	//type		symmetryPlane;
    }
    solidSurfaces
    {
        type            kqRWallFunction;
        value		uniform $kConstant;
    }
}

// ************************************************************************* //
